{
 "n_tags": 3000,
 "scope": "book.tags + user.like + user.dislike",
 "total_occurrences": 1076800,
 "distinct_phrases": 227280,
 "coverage": 0.5955,
 "phrase2id": {
  "Emotional Depth": 0,
  "Coming-of-Age": 1,
  "Dystopian": 2,
  "Fast Paced Action": 3,
  "Romance": 4,
  "Fast Paced": 5,
  "Series Continuity": 6,
  "Young Adult": 7,
  "Moral Ambiguity": 8,
  "Character Growth": 9,
  "Slow Pacing": 10,
  "Strong Female Protagonists": 11,
  "Predictable Plots": 12,
  "Morally Grey Characters": 13,
  "Romantic Tension": 14,
  "Slow Burn Romance": 15,
  "World Building": 16,
  "Coming of Age": 17,
  "Character Development": 18,
  "Mystery": 19,
  "Fast-Paced Action": 20,
  "Character Growth Arcs": 21,
  "Dark Fantasy": 22,
  "Young Adult Fiction": 23,
  "Mystery Thriller": 24,
  "Fantasy Adventure": 25,
  "Romantic Comedy": 26,
  "Strong Character Development": 27,
  "Friendship": 28,
  "Young Adult Fantasy": 29,
  "School Life": 30,
  "Urban Fantasy": 31,
  "Family Drama": 32,
  "Emotional Character Arcs": 33,
  "High Stakes": 34,
  "High Stakes Action": 35,
  "Unexpected Twists": 36,
  "Emotional Resonance": 37,
  "Family Secrets": 38,
  "Historical Fiction": 39,
  "High Stakes Dystopia": 40,
  "Twists and Turns": 41,
  "Strong Female Leads": 42,
  "Magical Realism": 43,
  "Predictable Plot Twists": 44,
  "Predictable Tropes": 45,
  "Teen Drama": 46,
  "Coming-of-Age Stories": 47,
  "Fantasy": 48,
  "Dystopian Settings": 49,
  "Time Travel": 50,
  "Moral Complexity": 51,
  "Unexpected Plot Twists": 52,
  "Predictable Endings": 53,
  "Family Dynamics": 54,
  "Teen Angst": 55,
  "Unreliable Narrators": 56,
  "Magic System": 57,
  "Female Protagonist": 58,
  "Series Completion": 59,
  "Humor": 60,
  "Enemies-to-Lovers": 61,
  "Immersive World Building": 62,
  "First Love": 63,
  "Unpredictable Twists": 64,
  "Emotional Intensity": 65,
  "Emotional Storytelling": 66,
  "Magic Systems": 67,
  "Angst": 68,
  "Secret Identity": 69,
  "Political Intrigue": 70,
  "Unpredictable Plot Twists": 71,
  "Unreliable Narrator": 72,
  "Relatable Protagonists": 73,
  "Plot Twists": 74,
  "Post-Apocalyptic": 75,
  "Relatable Characters": 76,
  "High Stakes Fantasy": 77,
  "Coming-of-Age Themes": 78,
  "Rushed Endings": 79,
  "High School Drama": 80,
  "Forbidden Love": 81,
  "Multi-Perspective Narratives": 82,
  "Suspenseful Plots": 83,
  "Love Triangles": 84,
  "YA Fantasy": 85,
  "Psychological Thriller": 86,
  "Friendship Dynamics": 87,
  "Predictable Storylines": 88,
  "Dark Humor": 89,
  "Abrupt Endings": 90,
  "Fast Paced Plots": 91,
  "Mental Health Themes": 92,
  "Supernatural Thriller": 93,
  "Page Turners": 94,
  "Ensemble Cast": 95,
  "Self-Discovery": 96,
  "Twist Plots": 97,
  "Satisfying Endings": 98,
  "Cliffhangers": 99,
  "High Stakes Drama": 100,
  "Emotional Rollercoasters": 101,
  "YA Dystopia": 102,
  "Complex Character Arcs": 103,
  "Mature Themes": 104,
  "Fairy Tale Retellings": 105,
  "Mystery Elements": 106,
  "Adventure": 107,
  "Romantic Angst": 108,
  "Greek Mythology": 109,
  "Love Triangle": 110,
  "Complex Relationships": 111,
  "Romantic Suspense": 112,
  "Magic Realism": 113,
  "Humorous Tone": 114,
  "Complex Characters": 115,
  "Identity Crisis": 116,
  "Romantic Pairings": 117,
  "Supernatural Elements": 118,
  "Emotional Drama": 119,
  "Pacing Issues": 120,
  "Mystery Thrillers": 121,
  "Emotional Impact": 122,
  "Young Adult Dystopia": 123,
  "Psychological Depth": 124,
  "Fast-Paced Plots": 125,
  "Survival Horror": 126,
  "Fantasy Romance": 127,
  "Paranormal Romance": 128,
  "Witty Dialogue": 129,
  "Suspense": 130,
  "Relatable Teen Protagonists": 131,
  "Romance Subplot": 132,
  "Sweet Romance": 133,
  "Complex Character Dynamics": 134,
  "Emotional Character Growth": 135,
  "Friendship Drama": 136,
  "Second Chance Love": 137,
  "Slow Start": 138,
  "Twist Endings": 139,
  "YA Romance": 140,
  "Science Fiction": 141,
  "Complex Character Development": 142,
  "Fast-Paced Adventure": 143,
  "Teen Protagonist": 144,
  "Romance Novel": 145,
  "World-Building": 146,
  "Teen Romance": 147,
  "Action-Packed": 148,
  "Boring Pacing": 149,
  "Social Commentary": 150,
  "Romantic Subplots": 151,
  "Vampire Romance": 152,
  "Thriller": 153,
  "Emotional Rollercoaster": 154,
  "Space Opera": 155,
  "Character-Driven": 156,
  "Survival Thriller": 157,
  "Strong Female Characters": 158,
  "High Stakes Survival": 159,
  "Unresolved Plot Holes": 160,
  "Complex Morality": 161,
  "High Stakes Dystopias": 162,
  "Character-Driven Stories": 163,
  "Thought-Provoking Themes": 164,
  "Romantic Fantasy": 165,
  "Action Adventure": 166,
  "Fast Paced Narratives": 167,
  "Mythology": 168,
  "Predictable Plot": 169,
  "Small Town": 170,
  "Engaging Plot": 171,
  "Emotional": 172,
  "Lack of Character Development": 173,
  "Teen Fiction": 174,
  "Addictive Pacing": 175,
  "Dark Academia": 176,
  "Sequel Satisfaction": 177,
  "Cliché Tropes": 178,
  "Dystopian Sci-Fi": 179,
  "Slow Burn": 180,
  "Fast Paced Reading": 181,
  "Predictable Twists": 182,
  "Small Town Drama": 183,
  "Unpredictable Plots": 184,
  "Secrets Revealed": 185,
  "Emotional Angst": 186,
  "Confusing Plot": 187,
  "High Stakes Plots": 188,
  "Ensemble Cast Dynamics": 189,
  "Unlikable Protagonists": 190,
  "Beautiful Writing Style": 191,
  "Complex World Building": 192,
  "Best Friends": 193,
  "Overused Tropes": 194,
  "Post-Apocalyptic Survival": 195,
  "Fast Paced Adventure": 196,
  "High Stakes Romance": 197,
  "YA Fiction": 198,
  "Heartbreaking Stories": 199,
  "Humorous Dialogue": 200,
  "Heartwarming Stories": 201,
  "Poetic Prose": 202,
  "Strong Heroines": 203,
  "Unputdownable Pacing": 204,
  "Suspenseful": 205,
  "Post-Apocalyptic Settings": 206,
  "Rushed Pacing": 207,
  "Small Town Mystery": 208,
  "Predictable Character Arcs": 209,
  "Bittersweet Endings": 210,
  "Unresolved Endings": 211,
  "Realistic Teen Relationships": 212,
  "Complex Family Dynamics": 213,
  "Realistic Relationships": 214,
  "Moral Dilemma": 215,
  "Gritty Realism": 216,
  "Character Depth": 217,
  "Series Continuations": 218,
  "Family Conflict": 219,
  "Dystopian Fiction": 220,
  "Predictable Outcomes": 221,
  "Unique World Building": 222,
  "Strong Character Growth": 223,
  "Fast-Paced Thrillers": 224,
  "Drama": 225,
  "Dystopian Society": 226,
  "Mental Health Awareness": 227,
  "Emotional Roller Coaster": 228,
  "Series Completion Satisfaction": 229,
  "Strong Character Arcs": 230,
  "Comedy": 231,
  "High School Romance": 232,
  "Fantasy Series": 233,
  "Beautiful Writing": 234,
  "Emotional Stakes": 235,
  "Complex Protagonists": 236,
  "Good vs Evil": 237,
  "Suspenseful Mystery": 238,
  "Supernatural Horror": 239,
  "Dark Themes": 240,
  "Psychological Horror": 241,
  "Dystopian Romance": 242,
  "Creepy Atmosphere": 243,
  "Underdeveloped Characters": 244,
  "New Adult": 245,
  "Satisfying Series Endings": 246,
  "Strong Character Bonds": 247,
  "YA Dystopian": 248,
  "Suspenseful Plot Twists": 249,
  "Romantic Chemistry": 250,
  "Emotional Growth": 251,
  "Heartbreaking Endings": 252,
  "Action Packed": 253,
  "High Fantasy": 254,
  "Small Town Life": 255,
  "Detailed World Building": 256,
  "Contemporary Romance": 257,
  "Fast-Paced": 258,
  "Redemption Arc": 259,
  "Character-Driven Plots": 260,
  "Realistic Character Development": 261,
  "Sibling Bonding": 262,
  "Lack of Character Depth": 263,
  "Ensemble Casts": 264,
  "Dystopian Thriller": 265,
  "Greek Mythology Adaptations": 266,
  "Multiple Perspectives": 267,
  "Immersive Storytelling": 268,
  "High Stakes Adventure": 269,
  "Inspirational Themes": 270,
  "Unrequited Love": 271,
  "Flat Characters": 272,
  "Psychological Thrillers": 273,
  "Atmospheric Settings": 274,
  "Series Continuation": 275,
  "Fast Paced Thrillers": 276,
  "Second Chance": 277,
  "Young Adult Thriller": 278,
  "Friendship Betrayal": 279,
  "Cliffhanger Endings": 280,
  "Multi-Perspective Storytelling": 281,
  "Sisterhood": 282,
  "World Building Depth": 283,
  "Paranormal Elements": 284,
  "Teen Protagonists": 285,
  "Emotional Character Development": 286,
  "Original Concepts": 287,
  "Coming-of-Age Drama": 288,
  "Second Chances": 289,
  "Coming-of-Age Story": 290,
  "Betrayal": 291,
  "Action Thriller": 292,
  "School Bullying": 293,
  "Dark Romance": 294,
  "Slow Starts": 295,
  "Mental Health": 296,
  "Strong World Building": 297,
  "Suspenseful Pacing": 298,
  "High Stakes Thrillers": 299,
  "Fast-Paced Action Sequences": 300,
  "Series": 301,
  "Witty Humor": 302,
  "Heartfelt Stories": 303,
  "Unlikable Characters": 304,
  "Confusing Narratives": 305,
  "Relatable Teen Experiences": 306,
  "Humorous": 307,
  "Complex Morally Grey Characters": 308,
  "Dark Atmosphere": 309,
  "Realistic Fiction": 310,
  "Historical Fantasy": 311,
  "Hopeful Themes": 312,
  "YA Contemporary Fiction": 313,
  "Quick Reads": 314,
  "Zombie Apocalypse": 315,
  "Lack of Originality": 316,
  "Fast Paced Dystopia": 317,
  "LGBTQ+": 318,
  "Happy Endings": 319,
  "Predictable": 320,
  "Dark Comedy": 321,
  "Repetitive Storylines": 322,
  "Character Development Arcs": 323,
  "Unreliable Narratives": 324,
  "Secrets": 325,
  "Trauma Recovery": 326,
  "Philosophical Themes": 327,
  "Unresolved Character Arcs": 328,
  "Coming of Age Stories": 329,
  "Fast Paced Plotting": 330,
  "Short Stories": 331,
  "Boring Middle Sections": 332,
  "Revenge": 333,
  "Crying Inducement": 334,
  "Romantic Comedy Tropes": 335,
  "Heartfelt Storytelling": 336,
  "Engaging Pacing": 337,
  "Realistic Character Growth": 338,
  "Emotional Payoffs": 339,
  "Dystopian Future": 340,
  "Strong Character Dynamics": 341,
  "Suspenseful Plot": 342,
  "Romance Subplots": 343,
  "Well Developed Characters": 344,
  "Short Length": 345,
  "Unlikable Antagonists": 346,
  "Satisfying Conclusions": 347,
  "College Life": 348,
  "Romantic Relationships": 349,
  "Grief Recovery": 350,
  "Relatable Character Growth": 351,
  "Female Friendship": 352,
  "Unnecessary Subplots": 353,
  "Heartwarming": 354,
  "Boring": 355,
  "Dystopian Science Fiction": 356,
  "Unputdownable": 357,
  "Psychological Suspense": 358,
  "Fantasy World Building": 359,
  "Character Backstories": 360,
  "Series Conclusions": 361,
  "Female Protagonists": 362,
  "Complex Plot Twists": 363,
  "Intense Pacing": 364,
  "Sibling Rivalry": 365,
  "Action-Packed Plots": 366,
  "Hopeful Endings": 367,
  "Grief Processing": 368,
  "Haunting Atmosphere": 369,
  "Female Empowerment": 370,
  "Redemption Arcs": 371,
  "Engaging Storylines": 372,
  "Dystopian Fantasy": 373,
  "Murder Mystery": 374,
  "Epic Fantasy": 375,
  "Mind-Bending Twists": 376,
  "World-Building Depth": 377,
  "Secret Society": 378,
  "Steampunk": 379,
  "Atmospheric World Building": 380,
  "Confusing Plots": 381,
  "Engaging Plot Twists": 382,
  "Dark Secrets": 383,
  "Summer Romance": 384,
  "Sci-Fi": 385,
  "Lack of Depth": 386,
  "Unanswered Questions": 387,
  "Fast-Paced Narratives": 388,
  "Feminist Themes": 389,
  "Lyrical Prose": 390,
  "Confusing Plot Structure": 391,
  "Psychological Tension": 392,
  "Strong Protagonists": 393,
  "Quick Pacing": 394,
  "Predictable Love Triangles": 395,
  "Romance Comedy": 396,
  "Emotional Roller Coasters": 397,
  "Emotional Heartbreak": 398,
  "Revenge Plot": 399,
  "Lack of Action": 400,
  "Annoying Protagonists": 401,
  "Whiny Protagonists": 402,
  "Group Dynamics": 403,
  "Witchcraft": 404,
  "Fate vs Free Will": 405,
  "Dystopian Societies": 406,
  "Supernatural Mystery": 407,
  "Fantasy Worlds": 408,
  "Best Friends To Lovers": 409,
  "Diverse Characters": 410,
  "YA Contemporary": 411,
  "Lack of Closure": 412,
  "Confusing Plotlines": 413,
  "Ghost Stories": 414,
  "Series Potential": 415,
  "Overused Clichés": 416,
  "Coming of Age Themes": 417,
  "Realistic Characters": 418,
  "Excessive Length": 419,
  "Middle Grade Fiction": 420,
  "Small Town Secrets": 421,
  "Twists": 422,
  "Overly Slow Pacing": 423,
  "Survival": 424,
  "Secret Identities": 425,
  "Relatable Themes": 426,
  "LGBTQ+ Representation": 427,
  "Team Dynamics": 428,
  "Grief and Loss": 429,
  "John Green": 430,
  "Young Adult Contemporary": 431,
  "Emotional Healing": 432,
  "Suspenseful Atmosphere": 433,
  "Dystopian Elements": 434,
  "Mystery Twists": 435,
  "Dark Fantasy Settings": 436,
  "Futuristic Settings": 437,
  "Realistic Teen Drama": 438,
  "Authentic Voice": 439,
  "Engaging Plots": 440,
  "Unique World-Building": 441,
  "Creative World Building": 442,
  "Life Lessons": 443,
  "Action": 444,
  "Greek Mythology Retellings": 445,
  "Unique Premises": 446,
  "Social Issues": 447,
  "Selfish Protagonists": 448,
  "Gothic Atmosphere": 449,
  "Supernatural Powers": 450,
  "Complex Villains": 451,
  "Fantasy Elements": 452,
  "Unpredictable Endings": 453,
  "Social Justice Themes": 454,
  "Southern Gothic": 455,
  "Psychological Drama": 456,
  "Tragedy": 457,
  "Moral Dilemmas": 458,
  "Inconsistent Pacing": 459,
  "Flat Character Development": 460,
  "Serial Killer": 461,
  "Satisfying Plot Twists": 462,
  "Young Adult Mystery": 463,
  "Post-Apocalyptic Dystopia": 464,
  "Humorous Moments": 465,
  "Dystopian Worlds": 466,
  "Overwhelming Pacing": 467,
  "Predictable Story Arcs": 468,
  "One-Dimensional Characters": 469,
  "Plot Holes": 470,
  "Predictable Plot Points": 471,
  "Lack of Engagement": 472,
  "High School Settings": 473,
  "Page-Turning Pacing": 474,
  "Imaginative World Building": 475,
  "Satisfying Cliffhangers": 476,
  "Beautifully Written": 477,
  "Surprising Plot Twists": 478,
  "Action Packed Plots": 479,
  "High Stakes Suspense": 480,
  "Dark Fantasy Elements": 481,
  "Mental Illness Themes": 482,
  "Complex Antagonists": 483,
  "Rebellion": 484,
  "Dark Fantasy Worlds": 485,
  "Short Story Collections": 486,
  "Bullying": 487,
  "Diverse Perspectives": 488,
  "Young Adult Romance": 489,
  "Engaging Storytelling": 490,
  "High Stakes Mystery": 491,
  "Romantic Sequels": 492,
  "Cliché Plots": 493,
  "Unsatisfying Endings": 494,
  "Fast Paced Reads": 495,
  "Memory Loss": 496,
  "Dystopian YA": 497,
  "Fast Paced Plot": 498,
  "Action-Packed Adventure": 499,
  "High Concept Fantasy": 500,
  "Historical Settings": 501,
  "Unique Concepts": 502,
  "Short Story Collection": 503,
  "Supernatural Romance": 504,
  "High School Setting": 505,
  "Perfect Endings": 506,
  "Suspenseful Twists": 507,
  "Twins": 508,
  "Intriguing Plots": 509,
  "Believable Characters": 510,
  "YA Fantasy Series": 511,
  "Satisfying Twists": 512,
  "Page-Turner Pacing": 513,
  "Poetic Writing Style": 514,
  "Slice of Life": 515,
  "LGBTQ+ Themes": 516,
  "Enemies to Lovers": 517,
  "YA": 518,
  "Boring Plot": 519,
  "Prophecy": 520,
  "Hilarious Humor": 521,
  "Mind-Bending Plot Twists": 522,
  "Lack of Plot Progression": 523,
  "Teen Relationships": 524,
  "High-Octane Action": 525,
  "Emotional Tearjerkers": 526,
  "Well-Written Prose": 527,
  "Realistic Romance": 528,
  "Well Written": 529,
  "Realistic Teen Experiences": 530,
  "Short Story": 531,
  "Immersive World-Building": 532,
  "Fast Paced Plot Twists": 533,
  "High Pacing": 534,
  "Emotional Tear-Jerkers": 535,
  "Disappointing Endings": 536,
  "Fast-Paced Plot Twists": 537,
  "Complex Love Triangles": 538,
  "Fast-Paced Dystopia": 539,
  "Ghost Story": 540,
  "Character Arcs": 541,
  "Dystopian Themes": 542,
  "Unresolved Cliffhangers": 543,
  "Lack of Character Connection": 544,
  "Realistic Characterization": 545,
  "Imaginative Worlds": 546,
  "Boring Plots": 547,
  "Sci-Fi Thriller": 548,
  "Complex Magic Systems": 549,
  "Thought Provoking Themes": 550,
  "Complex Female Protagonists": 551,
  "Indonesian Literature": 552,
  "YA Contemporary Romance": 553,
  "Witty Banter": 554,
  "Sequel Anticipation": 555,
  "Unique Storytelling": 556,
  "Mental Health Struggles": 557,
  "Character-Driven Narratives": 558,
  "Well-Developed Characters": 559,
  "Relatable Teenagers": 560,
  "Mystery and Suspense": 561,
  "Poor Writing Quality": 562,
  "Formulaic Plots": 563,
  "School Drama": 564,
  "Road Trip Adventure": 565,
  "Mythological Settings": 566,
  "Depressing Tone": 567,
  "Multi-POV Narratives": 568,
  "Surprising Twists": 569,
  "Forbidden Love Tropes": 570,
  "Fast Pacing": 571,
  "Realistic Teen Angst": 572,
  "Satisfying Series Conclusions": 573,
  "Mental Illness": 574,
  "Identity Exploration": 575,
  "First Person Perspective": 576,
  "Confusing Plot Twists": 577,
  "Mystery & Suspense": 578,
  "Realistic Themes": 579,
  "Time Travel Adventures": 580,
  "Supernatural": 581,
  "Survival Stories": 582,
  "Unique Settings": 583,
  "Beautifully Written Prose": 584,
  "Romance Tropes": 585,
  "Predictable Romance": 586,
  "Quirky Humor": 587,
  "Flawed Protagonists": 588,
  "Horror Elements": 589,
  "Rushed Plot Progression": 590,
  "Series Progression": 591,
  "Personal Growth": 592,
  "Family Tragedy": 593,
  "Summer Vacation": 594,
  "Sequel Potential": 595,
  "Unpredictable Storylines": 596,
  "Road Trip Adventures": 597,
  "Flat Characterization": 598,
  "Page-Turners": 599,
  "Psychological Realism": 600,
  "Flawed Characters": 601,
  "Authentic Teen Voices": 602,
  "Satire": 603,
  "New York City": 604,
  "Coming Out Stories": 605,
  "Poor Pacing": 606,
  "Excessive Violence": 607,
  "Self-Acceptance": 608,
  "Inconsistent Tone": 609,
  "Music Industry": 610,
  "Grief": 611,
  "Second Chance Romance": 612,
  "Visual Storytelling": 613,
  "Relatable Teen Relationships": 614,
  "High Stakes Dystopian": 615,
  "Dark Fantasy Atmosphere": 616,
  "Sci-Fi Adventure": 617,
  "Child Protagonist": 618,
  "Self-Help": 619,
  "Gothic Horror": 620,
  "Steampunk Settings": 621,
  "Boarding School": 622,
  "Self Discovery": 623,
  "Heartfelt Romance": 624,
  "New Adult Romance": 625,
  "Poor Writing Style": 626,
  "Funny Humor": 627,
  "Predictable Villains": 628,
  "Emotional Tragedy": 629,
  "School Setting": 630,
  "Beautiful Prose": 631,
  "Intense Plot Twists": 632,
  "Teen Angst Themes": 633,
  "Emotional Connection": 634,
  "Multi-Perspective Narration": 635,
  "Hopeful Tone": 636,
  "Mary Sue Protagonists": 637,
  "Shocking Twists": 638,
  "Immersive Worlds": 639,
  "Insta-Love Tropes": 640,
  "Open Endings": 641,
  "Fast Paced Mystery": 642,
  "POV Switching": 643,
  "Heartbreaking": 644,
  "Graphic Violence": 645,
  "Psychic Abilities": 646,
  "Poor Editing": 647,
  "Humorous Protagonists": 648,
  "Unresolved Plot Threads": 649,
  "Debut Novel": 650,
  "Sad Endings": 651,
  "Romantic Tropes": 652,
  "Fantasy Settings": 653,
  "Realistic Family Dynamics": 654,
  "Twist Ending": 655,
  "Thought-Provoking": 656,
  "Short Chapters": 657,
  "Atmospheric Storytelling": 658,
  "Coming-of-Age Narratives": 659,
  "Authentic Character Voices": 660,
  "London Setting": 661,
  "Middle Grade": 662,
  "Strong Female Protagonist": 663,
  "Lack of Pacing": 664,
  "Emotional Roller Coaster Plots": 665,
  "Fast Paced Action Sequences": 666,
  "Character Connection": 667,
  "Vivid World Building": 668,
  "Fast-Paced Storytelling": 669,
  "High Stakes Plot Twists": 670,
  "Satisfying Sequels": 671,
  "Repetitive Storytelling": 672,
  "Underdog Protagonists": 673,
  "Character Study": 674,
  "Friendship Bonds": 675,
  "Moral Lessons": 676,
  "Forced Romance": 677,
  "Emotional Character Depth": 678,
  "Predictable Plotlines": 679,
  "Teen Mystery": 680,
  "Young Adult Adventure": 681,
  "Realistic Teen Life": 682,
  "Rushed Plot": 683,
  "Horror Thriller": 684,
  "Rich World Building": 685,
  "Weak Character Development": 686,
  "High Concept Sci-Fi": 687,
  "Fast-Paced Plotting": 688,
  "Humorous Satire": 689,
  "Forbidden Romance": 690,
  "Underdeveloped Side Characters": 691,
  "Fairy Tale Retelling": 692,
  "Unique Perspectives": 693,
  "Emotional Storylines": 694,
  "Magic": 695,
  "Smart Protagonists": 696,
  "Cultural Identity": 697,
  "Body Horror": 698,
  "Orphan Protagonist": 699,
  "Realistic Teenagers": 700,
  "Unreliable Narration": 701,
  "Original Storytelling": 702,
  "Realistic YA": 703,
  "High Concept Premises": 704,
  "High Stakes Action Sequences": 705,
  "Quirky Characters": 706,
  "Norse Mythology": 707,
  "Rushed Ending": 708,
  "Slow Beginnings": 709,
  "Repetitive Plot": 710,
  "Rivalry": 711,
  "Unresolved Relationships": 712,
  "Government Conspiracy": 713,
  "Mythological Creatures": 714,
  "Sisterly Bonding": 715,
  "Addictive Storytelling": 716,
  "Realistic Dialogue": 717,
  "Secret Relationship": 718,
  "Foster Care": 719,
  "Tragic Endings": 720,
  "Boring Slow Starts": 721,
  "Sacrifice": 722,
  "Confusing Narrative Structure": 723,
  "Vampires": 724,
  "Dragons": 725,
  "Mental Health Representation": 726,
  "Time Travel Mechanics": 727,
  "High School Romances": 728,
  "Shapeshifters": 729,
  "Sequel Series": 730,
  "Psychic Powers": 731,
  "Twisted Fairy Tales": 732,
  "Original World Building": 733,
  "Emotional Payoff": 734,
  "Predictable Sequels": 735,
  "Road Trip": 736,
  "Aliens": 737,
  "Religious Themes": 738,
  "Fairytale Retellings": 739,
  "Unique Writing Style": 740,
  "Addictive Storylines": 741,
  "Repetitive Plotlines": 742,
  "Gripping Pacing": 743,
  "Thought Provoking": 744,
  "Relatable Character Arcs": 745,
  "Hidden Identity": 746,
  "Paranormal Mystery": 747,
  "Slow Beginning": 748,
  "Strong Friendships": 749,
  "Gripping Plots": 750,
  "Superpowers": 751,
  "Sibling Dynamics": 752,
  "Diverse Representation": 753,
  "Mystery Plots": 754,
  "Poor Character Development": 755,
  "Sports Fiction": 756,
  "Diary Format": 757,
  "Quirky Protagonists": 758,
  "Protective Male Leads": 759,
  "Sweet Romances": 760,
  "Overly Dramatic": 761,
  "Morally Grey Protagonists": 762,
  "Sequels": 763,
  "Spy Thriller": 764,
  "Lack of Emotional Connection": 765,
  "Telling Instead of Showing": 766,
  "Intense Storytelling": 767,
  "Complex Plots": 768,
  "Confusing Plot Points": 769,
  "Mind-Bending Plots": 770,
  "Relatable Relationships": 771,
  "Relatable Teen Angst": 772,
  "Poetic Prose Style": 773,
  "Mystery Solving": 774,
  "Disability Representation": 775,
  "Suspense Thriller": 776,
  "Tedious Pacing": 777,
  "Vivid Descriptions": 778,
  "Contemporary YA": 779,
  "Humor Amidst Tragedy": 780,
  "Complex Moral Ambiguity": 781,
  "Toxic Relationships": 782,
  "Romantic": 783,
  "Original Storylines": 784,
  "Relatable Teen Struggles": 785,
  "Formulaic Storylines": 786,
  "Realistic Teen Issues": 787,
  "Boarding School Settings": 788,
  "Supernatural Abilities": 789,
  "Revenge Thriller": 790,
  "Shallow Characters": 791,
  "Atmospheric Tension": 792,
  "Lack of Emotional Depth": 793,
  "Mystery and Intrigue": 794,
  "Unresolved Plot Points": 795,
  "Disappointing Sequels": 796,
  "Fast-Paced Mystery": 797,
  "Survival Thrillers": 798,
  "Page Turner": 799,
  "Twists and Surprises": 800,
  "Character Attachment": 801,
  "Confusing Endings": 802,
  "Character Loyalty": 803,
  "Lyrical Writing Style": 804,
  "High Concept Dystopia": 805,
  "Dark Tone": 806,
  "Complex Character Growth": 807,
  "Predictable Clichés": 808,
  "Engaging Character Development": 809,
  "Teen Life": 810,
  "Rural Life": 811,
  "War Drama": 812,
  "Paranormal Fantasy": 813,
  "Multiple POVs": 814,
  "Dystopia": 815,
  "Naive Protagonists": 816,
  "Angst with Happy Endings": 817,
  "Inconsistent Characterization": 818,
  "Twisted Plots": 819,
  "Supernatural Creatures": 820,
  "Friendship Themes": 821,
  "Stereotypical Characters": 822,
  "Anti-Climactic Endings": 823,
  "Heartbreaking Moments": 824,
  "Complex Anti-Heroes": 825,
  "Small Town Setting": 826,
  "Twisting Plots": 827,
  "John Green Style": 828,
  "Mythical Creatures": 829,
  "Cute Romance": 830,
  "Annoying Characters": 831,
  "Immersive Settings": 832,
  "Cheesy Dialogue": 833,
  "Rebellion Against Authority": 834,
  "Island Setting": 835,
  "Epic Quest": 836,
  "First Love Angst": 837,
  "Strong Female Heroes": 838,
  "Unique Storylines": 839,
  "Unputdownable Stories": 840,
  "Suspenseful Thrillers": 841,
  "Quick Read": 842,
  "Series Loyalty": 843,
  "Engaging Mystery": 844,
  "Empowering Female Protagonists": 845,
  "Realistic Teen Perspectives": 846,
  "Small Town Settings": 847,
  "Dystopian World Building": 848,
  "Young Adult Science Fiction": 849,
  "Poor Execution": 850,
  "Entertaining": 851,
  "Survival Themes": 852,
  "Shallow Character Development": 853,
  "Underdog Story": 854,
  "Suspenseful Thriller": 855,
  "Alternate History": 856,
  "Heartfelt Narratives": 857,
  "Lack of Character Growth": 858,
  "One Dimensional Characters": 859,
  "Jealousy": 860,
  "Inspirational": 861,
  "YA Mystery": 862,
  "Epistolary Format": 863,
  "Satisfying Story Arcs": 864,
  "Predictable YA Tropes": 865,
  "Shocking Plot Twists": 866,
  "Engaging Story": 867,
  "Complex Narratives": 868,
  "Annoying Side Characters": 869,
  "High Stakes Cliffhangers": 870,
  "Complex Character Relationships": 871,
  "Mythology Integration": 872,
  "Unexpected Endings": 873,
  "Repetitive Plots": 874,
  "Predictable Love Interests": 875,
  "High-Octane Action Sequences": 876,
  "Secret Crush": 877,
  "Happily Ever After": 878,
  "Lack of Plot": 879,
  "Heart-Wrenching Stories": 880,
  "Well-Written Narratives": 881,
  "Relatable Family Dynamics": 882,
  "Abrupt Plot Twists": 883,
  "Fast Paced Sequels": 884,
  "Fake Relationship": 885,
  "Resilience": 886,
  "YA Adventure": 887,
  "Hopeful Resilience": 888,
  "Accessible Writing Style": 889,
  "Dual Perspectives": 890,
  "Lack of Detail": 891,
  "Vivid Imagery": 892,
  "Complex Moral Choices": 893,
  "Satisfying Series Arcs": 894,
  "Romantic Love Stories": 895,
  "Family Trauma": 896,
  "Relatable Struggles": 897,
  "Repetitive Dialogue": 898,
  "Fast Paced Suspense": 899,
  "Thrilling Pacing": 900,
  "Atmospheric Horror": 901,
  "Unhappy Endings": 902,
  "Pop Culture References": 903,
  "Repetitive Plot Points": 904,
  "Self-Esteem": 905,
  "Secret Societies": 906,
  "Character Evolution": 907,
  "Lack of World Building": 908,
  "Strong Character Voices": 909,
  "Inclusive Representation": 910,
  "Realistic Character Flaws": 911,
  "Vampire": 912,
  "Opposites Attract": 913,
  "Political Thriller": 914,
  "Historical Mystery": 915,
  "Angels & Demons": 916,
  "Cyberpunk": 917,
  "Funny": 918,
  "Inclusive Themes": 919,
  "Snarky Humor": 920,
  "Mystery and Secrets": 921,
  "Empowering Themes": 922,
  "Twist-Filled Plots": 923,
  "Strong Character Growth Arcs": 924,
  "Dual Point of View": 925,
  "Music Integration": 926,
  "Detailed Descriptions": 927,
  "Romantic Triangles": 928,
  "Non-Linear Storytelling": 929,
  "Intricate Plots": 930,
  "Original Premises": 931,
  "Confusing Pacing": 932,
  "Time Travel Concepts": 933,
  "Inspiring Themes": 934,
  "Relatable Teen Themes": 935,
  "Twisty Plots": 936,
  "Emotional Story Arcs": 937,
  "Realistic Teen Voices": 938,
  "Kindness Themes": 939,
  "Boring Protagonists": 940,
  "High Stakes Dilemmas": 941,
  "Urban Life": 942,
  "Realistic Drama": 943,
  "New Adult Fiction": 944,
  "Horror": 945,
  "Power Dynamics": 946,
  "Character-Driven Drama": 947,
  "Addictive": 948,
  "POV Shifts": 949,
  "Melodrama": 950,
  "Strong Character Chemistry": 951,
  "Unrealistic Relationships": 952,
  "Stilted Dialogue": 953,
  "Complex Heroines": 954,
  "Distinct Character Voices": 955,
  "Compelling Character Arcs": 956,
  "Twists and Turns Plots": 957,
  "Historical Context": 958,
  "Page-Turner": 959,
  "Emotional Realism": 960,
  "Complex Friendships": 961,
  "Nostalgic Themes": 962,
  "Emotional Growth Arcs": 963,
  "Science Fiction Thriller": 964,
  "Coming Out": 965,
  "Realistic Settings": 966,
  "Childish Tone": 967,
  "High Stakes Action Sequels": 968,
  "Time Travel Elements": 969,
  "Demons": 970,
  "Contemporary Fiction": 971,
  "Unrelatable Characters": 972,
  "Intricate Plot Twists": 973,
  "Emotional Investment": 974,
  "Detective Fiction": 975,
  "Romantic Tragedy": 976,
  "Parallel Worlds": 977,
  "Fate and Destiny": 978,
  "Relatable Main Characters": 979,
  "Unreliable Protagonists": 980,
  "Complex Themes": 981,
  "Tear-Jerking Stories": 982,
  "Nostalgic Settings": 983,
  "Deep Character Development": 984,
  "High-Stakes Action": 985,
  "Dystopian Survival": 986,
  "Heartbreaking Romance": 987,
  "Paranormal": 988,
  "Psychological Thriller Elements": 989,
  "Rushed Plots": 990,
  "High-Stakes Plots": 991,
  "Intricate World Building": 992,
  "Page-Turning Plots": 993,
  "Destiny": 994,
  "Emotional Romance": 995,
  "Poor Writing": 996,
  "Sisters": 997,
  "Sports Drama": 998,
  "Poetic Style": 999,
  "Heartwarming Themes": 1000,
  "Complex World-Building": 1001,
  "Predictable Romance Tropes": 1002,
  "Awkward Dialogue": 1003,
  "Unresolved Plot": 1004,
  "Dark Magic": 1005,
  "Autism Representation": 1006,
  "Reimagined Fairy Tales": 1007,
  "Self-Acceptance Themes": 1008,
  "Fast-Paced Suspense": 1009,
  "Touching Stories": 1010,
  "Childrens Literature": 1011,
  "Social Justice": 1012,
  "Crime Fiction": 1013,
  "Rebellion Themes": 1014,
  "Mystery Plot Twists": 1015,
  "Transgender Representation": 1016,
  "Original Plots": 1017,
  "Excessive Exposition": 1018,
  "Relatable Teen Characters": 1019,
  "Rushed Conclusions": 1020,
  "Vampire Fantasy": 1021,
  "Dreams vs Reality": 1022,
  "Time Travel Fantasy": 1023,
  "Underdog Stories": 1024,
  "Juvenile Writing Style": 1025,
  "Beautiful Storytelling": 1026,
  "Memorable Characters": 1027,
  "Boredom": 1028,
  "Unanswered Plot Questions": 1029,
  "Rick Riordan": 1030,
  "Realistic Teen Protagonists": 1031,
  "Twin Sisters": 1032,
  "Steamy Romance": 1033,
  "Zombies": 1034,
  "Character Dynamics": 1035,
  "Disturbing Themes": 1036,
  "Unique Character Dynamics": 1037,
  "Best Friends Rivals": 1038,
  "Typos": 1039,
  "Emotional Authenticity": 1040,
  "Cheesy Romance": 1041,
  "High School Realism": 1042,
  "Cheesy Tropes": 1043,
  "Romantic Love Triangles": 1044,
  "Snarky Protagonists": 1045,
  "High-Stakes Dystopias": 1046,
  "Character Driven Stories": 1047,
  "Dark Fairy Tales": 1048,
  "Sisterly Bond": 1049,
  "Emotional Endings": 1050,
  "Immersive Atmosphere": 1051,
  "New York Setting": 1052,
  "Family Struggles": 1053,
  "Summer Reads": 1054,
  "Cliché Storylines": 1055,
  "Compelling Plot Twists": 1056,
  "Conspiracy Thriller": 1057,
  "Action Sequences": 1058,
  "Unique Magic Systems": 1059,
  "Compelling Plot": 1060,
  "Complex Anti-Hero Protagonists": 1061,
  "Lovable Characters": 1062,
  "Meaningful Themes": 1063,
  "Satisfying Series Conclusion": 1064,
  "Father-Son Relationship": 1065,
  "Revenge Fantasy": 1066,
  "Christian Fiction": 1067,
  "Teen Fantasy": 1068,
  "LGBTQ Themes": 1069,
  "Post-Apocalyptic Thriller": 1070,
  "Gripping Storylines": 1071,
  "Exciting Pacing": 1072,
  "Emotional Range": 1073,
  "High-Stakes Dystopia": 1074,
  "Abrupt Ending": 1075,
  "Surprising Endings": 1076,
  "Crime Drama": 1077,
  "Addictive Plot": 1078,
  "Unputdownable Plots": 1079,
  "Strong Friendship Dynamics": 1080,
  "Coming-of-Age Growth": 1081,
  "Suspenseful Cliffhangers": 1082,
  "Literary Fiction": 1083,
  "Eerie Atmosphere": 1084,
  "Nonlinear Storytelling": 1085,
  "Fast-Paced Plot": 1086,
  "Mythological Retellings": 1087,
  "Strong Independent Heroines": 1088,
  "Disturbing Content": 1089,
  "Repetitive Tropes": 1090,
  "Clichéd Tropes": 1091,
  "Tear-Jerking Moments": 1092,
  "Friendship Group": 1093,
  "Alien Invasion": 1094,
  "Vampire Lore": 1095,
  "Suspenseful Drama": 1096,
  "Violence": 1097,
  "Serial Killers": 1098,
  "YA Literature": 1099,
  "Unresolved Trauma": 1100,
  "Angst Overload": 1101,
  "Anthology": 1102,
  "Body Image": 1103,
  "Star-Crossed Lovers": 1104,
  "Multiple POV": 1105,
  "Whiny Characters": 1106,
  "Selfish Antagonists": 1107,
  "Mature YA Themes": 1108,
  "Authentic Voices": 1109,
  "Excessive Angst": 1110,
  "Repetitive Phrasing": 1111,
  "Sweet Romantic Tropes": 1112,
  "Werewolves": 1113,
  "Shapeshifter": 1114,
  "Historical Setting": 1115,
  "Memory Manipulation": 1116,
  "Sassy Protagonists": 1117,
  "Engaging Narratives": 1118,
  "Slow Paced": 1119,
  "Addictive Series": 1120,
  "Predictable Characters": 1121,
  "Lack of Emotional Impact": 1122,
  "Two-Dimensional Characters": 1123,
  "Debut Novels": 1124,
  "Mind-Bending Concepts": 1125,
  "Predictability": 1126,
  "Hopeful Ending": 1127,
  "Mystery Plot": 1128,
  "Sexual Tension": 1129,
  "Happy Ending": 1130,
  "Empathetic Protagonists": 1131,
  "Overly Fast Pacing": 1132,
  "Clever Plot Twists": 1133,
  "Self-Centered Protagonists": 1134,
  "Realistic Mental Health Portrayals": 1135,
  "Series Endings": 1136,
  "Character Redemption Arcs": 1137,
  "Predictable Plot Progression": 1138,
  "Reincarnation": 1139,
  "Romantic Subplot": 1140,
  "Family Reunion": 1141,
  "Middle Grade Fantasy": 1142,
  "Best Friend Dynamics": 1143,
  "Unrealistic Dialogue": 1144,
  "High Stakes Battles": 1145,
  "Unique Writing Styles": 1146,
  "Overcoming Adversity": 1147,
  "Humorous Fiction": 1148,
  "Dystopian Setting": 1149,
  "Stepfamily Drama": 1150,
  "Vampire Fiction": 1151,
  "Time Travel Adventure": 1152,
  "Tragic Romance": 1153,
  "Bullying Themes": 1154,
  "Satisfying Conclusion": 1155,
  "Forced Relationships": 1156,
  "Self-Absorbed Protagonists": 1157,
  "Predictable Character Choices": 1158,
  "Engaging Characters": 1159,
  "Fast Paced Storytelling": 1160,
  "Coming-of-Age Adventure": 1161,
  "Australian Setting": 1162,
  "Atmospheric": 1163,
  "Social Realism": 1164,
  "University Life": 1165,
  "Paranormal Thriller": 1166,
  "Existential Themes": 1167,
  "Holiday Romances": 1168,
  "Anticlimactic Endings": 1169,
  "Strong Female Heroines": 1170,
  "Revenge Themes": 1171,
  "Overly Complex Plots": 1172,
  "Boring Beginnings": 1173,
  "Romantic Connections": 1174,
  "Magical Realism Settings": 1175,
  "Murder Investigation": 1176,
  "Love Story": 1177,
  "Body Image Issues": 1178,
  "Running Away": 1179,
  "Healing Themes": 1180,
  "Conspiracy": 1181,
  "Moral Growth": 1182,
  "Coming-of-Age Angst": 1183,
  "High Stakes Sci-Fi": 1184,
  "Overwhelming Sadness": 1185,
  "Hard to Put Down": 1186,
  "Witty Protagonists": 1187,
  "Family Bonds": 1188,
  "Magic Academy": 1189,
  "Sports Romance": 1190,
  "First Person Narration": 1191,
  "Mythology Retellings": 1192,
  "Supportive Friendships": 1193,
  "Unrealistic Romance": 1194,
  "Unique Plot Twists": 1195,
  "Emotional Character Connections": 1196,
  "Romantic Reunions": 1197,
  "Sweet Romantic Pairings": 1198,
  "Siblings": 1199,
  "Genetic Engineering": 1200,
  "Unpredictable Plot": 1201,
  "Heartbreaking Storylines": 1202,
  "First Person Narratives": 1203,
  "Revisiting Favorites": 1204,
  "Non-Linear Narratives": 1205,
  "Cute Stories": 1206,
  "Excessive Drama": 1207,
  "Realistic Tragedy": 1208,
  "Satisfying Character Arcs": 1209,
  "Engaging World Building": 1210,
  "Believable Character Development": 1211,
  "Isolation": 1212,
  "Mermaid Fantasy": 1213,
  "Survival Story": 1214,
  "Speculative Fiction": 1215,
  "Long Distance Relationship": 1216,
  "Unexplained Plot Holes": 1217,
  "Gripping Plot": 1218,
  "Fast Paced Thriller": 1219,
  "Unresolved Story Arcs": 1220,
  "YA Sci-Fi": 1221,
  "Unrealistic Plot Points": 1222,
  "Excessive Dialogue": 1223,
  "Flawed Realistic Characters": 1224,
  "Father-Son Conflict": 1225,
  "Music Themes": 1226,
  "Queer Representation": 1227,
  "Boring Characters": 1228,
  "Shocking Endings": 1229,
  "Intense Action Sequences": 1230,
  "Post-Apocalyptic Worlds": 1231,
  "Futuristic Dystopias": 1232,
  "Perfect Series Endings": 1233,
  "Weak Endings": 1234,
  "Flawed Complex Characters": 1235,
  "Small Town Horror": 1236,
  "Mystery Suspense": 1237,
  "Dark Academia Vibes": 1238,
  "Suspenseful Plotting": 1239,
  "Humorous Coming-of-Age": 1240,
  "Modern Fantasy": 1241,
  "Heartfelt": 1242,
  "Perspective Shifts": 1243,
  "Easy Read": 1244,
  "Morally Complex Characters": 1245,
  "High School Angst": 1246,
  "Excessive Profanity": 1247,
  "Strong World-Building": 1248,
  "Strong Family Dynamics": 1249,
  "Apocalyptic Settings": 1250,
  "Dark Themes Handled Well": 1251,
  "Dark Dystopia": 1252,
  "Sequel": 1253,
  "Secrets and Lies": 1254,
  "Vampire Series": 1255,
  "Middle Grade Adventure": 1256,
  "Heartfelt Drama": 1257,
  "Emotional Catharsis": 1258,
  "Strong Narration": 1259,
  "Emotional Rollercoaster Plots": 1260,
  "Imaginative Settings": 1261,
  "Unrealistic Character Reactions": 1262,
  "Unresolved Mysteries": 1263,
  "Immersive Fantasy Worlds": 1264,
  "Excessive Swearing": 1265,
  "Teenagers": 1266,
  "Cultural Exploration": 1267,
  "Fantasy Comedy": 1268,
  "Drug Addiction": 1269,
  "Heartbreak": 1270,
  "Teen Pregnancy": 1271,
  "Sarcasm": 1272,
  "Relatable Coming-of-Age Themes": 1273,
  "Accessible Pacing": 1274,
  "Rushed Romance": 1275,
  "Overly Long Narratives": 1276,
  "Realistic Social Issues": 1277,
  "High Stakes Tension": 1278,
  "Intriguing Plot Twists": 1279,
  "Sweet Romantic Moments": 1280,
  "Faith-Based": 1281,
  "Crime Thriller": 1282,
  "Missing Person": 1283,
  "Suspenseful Romance": 1284,
  "Zombie Apocalypses": 1285,
  "Sadness": 1286,
  "Unique Voice": 1287,
  "Fast Paced Sci-Fi": 1288,
  "Instant Love Tropes": 1289,
  "Virtual Reality": 1290,
  "Urban Setting": 1291,
  "Character Studies": 1292,
  "Atmospheric Mystery": 1293,
  "Historical Romance": 1294,
  "Reimagined Classics": 1295,
  "Dystopian World": 1296,
  "Parallel Universes": 1297,
  "Vampire Stories": 1298,
  "Angsty Romance": 1299,
  "Angst-Rich Narratives": 1300,
  "Excessive Internal Monologue": 1301,
  "Overly Long": 1302,
  "Lyrical Writing": 1303,
  "Humorous Side Characters": 1304,
  "Non-Linear Narrative": 1305,
  "Unfinished Story Arcs": 1306,
  "Convenient Plot Twists": 1307,
  "Monster Hunters": 1308,
  "Classic Literature": 1309,
  "Young Adult Horror": 1310,
  "Demigods": 1311,
  "Dream Sequences": 1312,
  "Sensory Details": 1313,
  "Psychological Mystery": 1314,
  "Futuristic Dystopia": 1315,
  "Nostalgic": 1316,
  "Tragic Love Stories": 1317,
  "Multiple Points of View": 1318,
  "Snarky Dialogue": 1319,
  "Accessible Fantasy": 1320,
  "Unrealistic Teen Behavior": 1321,
  "Mental Illness Portrayal": 1322,
  "Strong Character Connections": 1323,
  "Perfect Pacing": 1324,
  "Fast-Paced Sci-Fi": 1325,
  "Confusing World-Building": 1326,
  "Complex Storylines": 1327,
  "Strong Heroine Protagonists": 1328,
  "Foster Care Drama": 1329,
  "Depression": 1330,
  "Aliens vs Humans": 1331,
  "Soulmates": 1332,
  "Intrigue": 1333,
  "Modern Fairy Tales": 1334,
  "Gripping": 1335,
  "Worldbuilding": 1336,
  "Exciting Plots": 1337,
  "Reflective Themes": 1338,
  "Loyal Friendships": 1339,
  "Modern Retellings": 1340,
  "YA Coming-of-Age Stories": 1341,
  "Amnesia": 1342,
  "Romance Drama": 1343,
  "Sci-Fi Elements": 1344,
  "Revisiting Classics": 1345,
  "Juvenile Tone": 1346,
  "Angsty Relationships": 1347,
  "Realistic Emotions": 1348,
  "Compelling Narratives": 1349,
  "Young Adult Themes": 1350,
  "Fairy Tale Twists": 1351,
  "Realistic Character Dynamics": 1352,
  "Derivative Plots": 1353,
  "Quirky Character Dynamics": 1354,
  "Summer Camp": 1355,
  "Victorian Era": 1356,
  "Magical Realism Elements": 1357,
  "Humorous Humor": 1358,
  "Epic Scale": 1359,
  "Realistic": 1360,
  "Melancholic Tone": 1361,
  "Suspenseful Endings": 1362,
  "Unrealistic Characters": 1363,
  "Dull Pacing": 1364,
  "Lack of Suspense": 1365,
  "Atmospheric Writing": 1366,
  "Mary Sue Characters": 1367,
  "Humorous Banter": 1368,
  "High Stakes Thrills": 1369,
  "Twists & Turns": 1370,
  "Time Travel Plots": 1371,
  "YA Mystery Thrillers": 1372,
  "Fast Paced Page Turners": 1373,
  "Series Continuity Satisfaction": 1374,
  "Small Town Romance": 1375,
  "Haunted House": 1376,
  "Epic Battles": 1377,
  "Strong Female Lead": 1378,
  "Teen Dystopia": 1379,
  "Body Image Themes": 1380,
  "Funny Moments": 1381,
  "Poor Grammar": 1382,
  "Clichés": 1383,
  "Inspirational Messages": 1384,
  "High Stakes Thriller": 1385,
  "Empowering Protagonists": 1386,
  "Greek Mythology Integration": 1387,
  "Fast-Paced Dystopias": 1388,
  "Destiny vs Free Will": 1389,
  "Werewolf Romance": 1390,
  "Hopeful": 1391,
  "Angels vs Demons": 1392,
  "Shifter Romance": 1393,
  "Unresolved Tension": 1394,
  "Unresolved Mystery": 1395,
  "Formulaic Storytelling": 1396,
  "Excessive Whining": 1397,
  "LGBTQ Representation": 1398,
  "Very Slow Pacing": 1399,
  "Multiple POV Narratives": 1400,
  "Fast Paced Narrative": 1401,
  "New Adult Fantasy": 1402,
  "Romance Suspense": 1403,
  "Found Family": 1404,
  "Overcoming Trauma": 1405,
  "Fairy Tales": 1406,
  "Suspenseful Adventure": 1407,
  "Bittersweet": 1408,
  "Emotional Manipulation": 1409,
  "Spooky Atmosphere": 1410,
  "First Love Stories": 1411,
  "Humor and Tears": 1412,
  "Rich Character Development": 1413,
  "Satisfying Resolutions": 1414,
  "Heartbreaking Plots": 1415,
  "Forced Plot Twists": 1416,
  "Captivating Storylines": 1417,
  "YA Thrillers": 1418,
  "YA Dystopias": 1419,
  "High-Stakes Drama": 1420,
  "Summer Adventure": 1421,
  "Superheroes": 1422,
  "Addiction Recovery": 1423,
  "Teen Rebellion": 1424,
  "Betrayal Themes": 1425,
  "Poetic Writing": 1426,
  "Spy Thrillers": 1427,
  "Rushed Plotting": 1428,
  "Engaging Plot Pacing": 1429,
  "Intriguing Premises": 1430,
  "Strong Characterization": 1431,
  "Emotional Honesty": 1432,
  "Anthology Collections": 1433,
  "World Building Immersion": 1434,
  "Werewolf": 1435,
  "Science Fiction Adventure": 1436,
  "Fashion Industry": 1437,
  "Realistic Storytelling": 1438,
  "Mythological Heroes": 1439,
  "Depression Themes": 1440,
  "Romantic Drama": 1441,
  "Cultural Authenticity": 1442,
  "Verse Novels": 1443,
  "Realistic Endings": 1444,
  "Unique Protagonists": 1445,
  "Lack of Mystery": 1446,
  "Multi-Dimensional Characters": 1447,
  "Choppy Writing Style": 1448,
  "Unresolved Plot Twists": 1449,
  "Purple Prose": 1450,
  "Engaging Sequels": 1451,
  "Descriptive Writing": 1452,
  "Powerful Storytelling": 1453,
  "Kidnapping Plot": 1454,
  "War": 1455,
  "Folklore": 1456,
  "Epic Adventure": 1457,
  "Angels": 1458,
  "Angels and Demons": 1459,
  "Futuristic Sci-Fi": 1460,
  "Imaginative World-Building": 1461,
  "First Person POV": 1462,
  "High-Stakes Fantasy": 1463,
  "Fresh Perspectives": 1464,
  "Predictable Happy Endings": 1465,
  "Psychological Complexity": 1466,
  "Detailed World-Building": 1467,
  "Brave Protagonists": 1468,
  "Creative Storytelling": 1469,
  "Relatable Character Struggles": 1470,
  "Original Story Concepts": 1471,
  "Historical Accuracy": 1472,
  "Sequel Continuity": 1473,
  "Self Discovery Arcs": 1474,
  "Engaging Mystery Plots": 1475,
  "Sibling Bond": 1476,
  "Mind Control": 1477,
  "Street Life": 1478,
  "Mentorship": 1479,
  "Romantic Comedy Elements": 1480,
  "High School": 1481,
  "Secret Keeping": 1482,
  "Free Verse Poetry": 1483,
  "Holiday Romance": 1484,
  "Confusing Beginnings": 1485,
  "Overly Long Books": 1486,
  "Fast Paced Thrills": 1487,
  "Dual Perspective Narratives": 1488,
  "Childish Writing Style": 1489,
  "Female Friendship Dynamics": 1490,
  "Well-Rounded Characters": 1491,
  "Action Packed Scenes": 1492,
  "Emotional Cliffhangers": 1493,
  "Empathetic Character Development": 1494,
  "Sweet Love Stories": 1495,
  "Fast-Paced Page Turners": 1496,
  "Shallow Characterization": 1497,
  "Strong Character Relationships": 1498,
  "Flashback Narratives": 1499,
  "Complex Morally Grey Protagonists": 1500,
  "Relatable Coming-of-Age Stories": 1501,
  "Treasure Hunt": 1502,
  "Siblings Bonding": 1503,
  "Body Positivity": 1504,
  "Memoir": 1505,
  "Egyptian Mythology": 1506,
  "YA Paranormal Romance": 1507,
  "Whimsical Tone": 1508,
  "Satisfying Arcs": 1509,
  "Emotional Character Bonds": 1510,
  "Unforgettable Characters": 1511,
  "Overly Depressing Tone": 1512,
  "Confusing World Building": 1513,
  "Third Person Perspective": 1514,
  "Forced Love Triangles": 1515,
  "Non-Stop Action": 1516,
  "Heart-Warming Stories": 1517,
  "Well-Written": 1518,
  "Complex Flawed Characters": 1519,
  "Short Reads": 1520,
  "Relatable Character Dynamics": 1521,
  "Intense Emotional Arcs": 1522,
  "Fast-Paced Fantasy": 1523,
  "Powerful Female Protagonists": 1524,
  "Original World-Building": 1525,
  "Fast Paced Dystopias": 1526,
  "Angst-Rich Storylines": 1527,
  "Coming Out Story": 1528,
  "Magic Powers": 1529,
  "Bittersweet Romance": 1530,
  "Lack of Excitement": 1531,
  "Lack of Plot Development": 1532,
  "Inconsistent Character Motivations": 1533,
  "Engaging": 1534,
  "Confusing Storylines": 1535,
  "Disappointing Pacing": 1536,
  "Grief Themes": 1537,
  "Emotional Family Drama": 1538,
  "Relatable Character Development": 1539,
  "Authentic Dialogue": 1540,
  "True Crime": 1541,
  "New Orleans Setting": 1542,
  "Time Travel Romance": 1543,
  "Adoption": 1544,
  "Rescue Mission": 1545,
  "Social Anxiety": 1546,
  "Environmental Themes": 1547,
  "New York Times Bestseller": 1548,
  "Time Loop": 1549,
  "Deus Ex Machina": 1550,
  "Cultural Representation": 1551,
  "Angst with Hope": 1552,
  "Overly Sentimental": 1553,
  "Filler Content": 1554,
  "Bland Characters": 1555,
  "Realistic Teen Struggles": 1556,
  "Nostalgic Atmosphere": 1557,
  "Complex Teen Relationships": 1558,
  "Heartbreaking Narratives": 1559,
  "Unique Narrative Formats": 1560,
  "School Mystery": 1561,
  "Poetry": 1562,
  "Family Saga": 1563,
  "Resistance Movement": 1564,
  "Flashbacks": 1565,
  "Emotional Trauma": 1566,
  "Character Driven": 1567,
  "Diverse Cast": 1568,
  "Heartfelt Moments": 1569,
  "Snappy Dialogue": 1570,
  "Unrealistic Character Behavior": 1571,
  "Inconsistent Quality": 1572,
  "Unresolved Subplots": 1573,
  "Surprise Twists": 1574,
  "Emotional Vulnerability": 1575,
  "Trans Representation": 1576,
  "Compelling Mystery": 1577,
  "Raw Emotions": 1578,
  "Over-the-Top Drama": 1579,
  "Preachy Themes": 1580,
  "Time Travel Stories": 1581,
  "Fast Paced Romances": 1582,
  "Self-Harm": 1583,
  "Sacrifice Themes": 1584,
  "World Building Expansion": 1585,
  "Southern Gothic Atmosphere": 1586,
  "Epic Storytelling": 1587,
  "Emotional Complexity": 1588,
  "Humorous Narration": 1589,
  "Heavy Themes": 1590,
  "Generic Tropes": 1591,
  "Childish Protagonists": 1592,
  "Life-Changing Impact": 1593,
  "Mental Illness Representation": 1594,
  "Powerful Themes": 1595,
  "Relatable Character Flaws": 1596,
  "Immature Protagonists": 1597,
  "Unlikable Protagonist": 1598,
  "Intense Suspense": 1599,
  "Touching Narratives": 1600,
  "Spiritual Themes": 1601,
  "Predictable Cliches": 1602,
  "YA Coming-of-Age": 1603,
  "Academy Life": 1604,
  "Twin Brothers": 1605,
  "Summer Setting": 1606,
  "Los Angeles Setting": 1607,
  "Medical Drama": 1608,
  "Fast Paced Romance": 1609,
  "Lack of Humor": 1610,
  "Fluffy Romance": 1611,
  "Feel-Good Stories": 1612,
  "Heist Stories": 1613,
  "Relatable Heroines": 1614,
  "Brutal Realism": 1615,
  "Lack of Substance": 1616,
  "Lack of Resolution": 1617,
  "Stupid Protagonists": 1618,
  "Flawed Heroines": 1619,
  "Chosen One": 1620,
  "Portal Fantasy": 1621,
  "Suspenseful Narrative": 1622,
  "Multiple Love Interests": 1623,
  "First-Person Narrative": 1624,
  "Suburban Life": 1625,
  "Clean Romance": 1626,
  "Twisted Relationships": 1627,
  "Angst and Tears": 1628,
  "Mental Health Narratives": 1629,
  "Overwhelming Emotional Intensity": 1630,
  "Fun Reads": 1631,
  "Self-Discovery Themes": 1632,
  "Dystopian Factions": 1633,
  "Time Travel Paradoxes": 1634,
  "Boring Middle": 1635,
  "Retellings": 1636,
  "Captivating Pacing": 1637,
  "Faction-Based Societies": 1638,
  "Poetic Language": 1639,
  "Complex Character Backstories": 1640,
  "Heroic Journey": 1641,
  "Apocalyptic": 1642,
  "Relatable": 1643,
  "Abusive Relationships": 1644,
  "Series Conclusion": 1645,
  "Mythological Fantasy": 1646,
  "Dysfunctional Families": 1647,
  "Cultural Diversity": 1648,
  "Poetic Storytelling": 1649,
  "Fantasy Retellings": 1650,
  "Forced Plot Points": 1651,
  "Fast Paced Stories": 1652,
  "Choppy Pacing": 1653,
  "Character Sacrifice": 1654,
  "Immersive Character Development": 1655,
  "Strong Characters": 1656,
  "Unresolved Storylines": 1657,
  "Compelling Characters": 1658,
  "Unnecessary Character Deaths": 1659,
  "High Stakes Heists": 1660,
  "Suspenseful Storytelling": 1661,
  "Emotional Climaxes": 1662,
  "Mental Illness Portrayals": 1663,
  "Gripping Suspense": 1664,
  "Unique Narrative Structures": 1665,
  "High Concept Dystopias": 1666,
  "Post-Apocalyptic Fantasy": 1667,
  "Forced Proximity": 1668,
  "Musician Protagonist": 1669,
  "Family Bonding": 1670,
  "Sarcastic Humor": 1671,
  "Relatable Stories": 1672,
  "Historical Adventure": 1673,
  "Gore": 1674,
  "Repetitive": 1675,
  "Sudden Plot Twists": 1676,
  "Confusing Narrative": 1677,
  "Profound Themes": 1678,
  "Twist and Turns": 1679,
  "Heartfelt Themes": 1680,
  "Edge-of-your-seat Pacing": 1681,
  "Realistic Coming-of-Age": 1682,
  "Overly Long Chapters": 1683,
  "Overwritten Prose": 1684,
  "Spoiled Protagonists": 1685,
  "Emotional Journeys": 1686,
  "Excessive Cursing": 1687,
  "High School Nostalgia": 1688,
  "High Fantasy World Building": 1689,
  "Compelling Character Development": 1690,
  "Trauma Recovery Themes": 1691,
  "Consequences": 1692,
  "School Life Drama": 1693,
  "Political Satire": 1694,
  "Cheerleading": 1695,
  "New York City Setting": 1696,
  "Emotional Turmoil": 1697,
  "World War II": 1698,
  "Rural Setting": 1699,
  "First-Person Perspective": 1700,
  "Educational Themes": 1701,
  "Greek Gods": 1702,
  "Diverse Protagonists": 1703,
  "Unfulfilled Expectations": 1704,
  "Annoying Antagonists": 1705,
  "Slow Burn Pacing": 1706,
  "Holiday Anthologies": 1707,
  "Weak Protagonists": 1708,
  "Beautiful Imagery": 1709,
  "Confusing Writing Style": 1710,
  "Twisted Narratives": 1711,
  "Cute": 1712,
  "Grammatical Errors": 1713,
  "Heartwarming Romance": 1714,
  "Cliché": 1715,
